src/cf/InformationRegisters/ОтменяемыеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтменяемыеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтменяемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОтменяемыеДокументы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр по переданным параметрам
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
//  ОтменяемыйДокумент - СправочникСсылка.ДокументыПредприятия
//  ДатаОтмены - Дата
Процедура ЗаписатьДанные(Документ, ОтменяемыйДокумент, ДатаОтмены) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	МенеджерЗаписиРегистра = РегистрыСведений.ОтменяемыеДокументы.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиРегистра.Документ = Документ;
	МенеджерЗаписиРегистра.ОтменяемыйДокумент = ОтменяемыйДокумент;
	МенеджерЗаписиРегистра.ДатаОтмены = ДатаОтмены;
	
	МенеджерЗаписиРегистра.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра по переданным параметрам
// 
// Параметры:
//  Документ  - СправочникСсылка.ДокументыПредприятия
//  ОтменяемыйДокумент  - СправочникСсылка.ДокументыПредприятия
Процедура УдалитьДанные(Документ, ОтменяемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	МенеджерЗаписиРегистра = РегистрыСведений.ОтменяемыеДокументы.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиРегистра.Документ = Документ;
	МенеджерЗаписиРегистра.ОтменяемыйДокумент = ОтменяемыйДокумент;
	
	МенеджерЗаписиРегистра.Удалить();
	
КонецПроцедуры

// Читает данные в регистре по переданным параметрам (Документ)
// 
// Параметры:
//  Документ  - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Массив из Структура
// 	*Документ - СправочникСсылка.ДокументыПредприятия
//	*ДатаОтмены - Дата
Функция ПрочитатьДанные(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтменяемыеДокументы.Документ,
	|	ОтменяемыеДокументы.ОтменяемыйДокумент,
	|	ОтменяемыеДокументы.ДатаОтмены
	|ИЗ
	|	РегистрСведений.ОтменяемыеДокументы КАК ОтменяемыеДокументы
	|ГДЕ
	|	ОтменяемыеДокументы.Документ = &Документ";
	
	Запрос.Параметры.Вставить("Документ", Документ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Запись Из Таблица Цикл
		
		ОписаниеДок = Новый Структура("Документ, ДатаОтмены", Запись.ОтменяемыйДокумент, Запись.ДатаОтмены);
		МассивДокументов.Добавить(ОписаниеДок);	
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

// Читает данные в регистре по переданным параметрам (ОтменяемыйДокумент)
// 
// Параметры:
//  ОтменяемыйДокумент - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Массив из Структура
// 	*Документ - СправочникСсылка.ДокументыПредприятия
//	*ДатаОтмены - Дата
Функция ПрочитатьНовыеДокументы(ОтменяемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтменяемыеДокументы.Документ,
	|	ОтменяемыеДокументы.ОтменяемыйДокумент,
	|	ОтменяемыеДокументы.ДатаОтмены
	|ИЗ
	|	РегистрСведений.ОтменяемыеДокументы КАК ОтменяемыеДокументы
	|ГДЕ
	|	ОтменяемыеДокументы.ОтменяемыйДокумент = &ОтменяемыйДокумент";
	
	Запрос.Параметры.Вставить("ОтменяемыйДокумент", ОтменяемыйДокумент);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Запись Из Таблица Цикл
		
		ОписаниеДок = Новый Структура("Документ, ДатаОтмены", Запись.Документ, Запись.ДатаОтмены);
		МассивДокументов.Добавить(ОписаниеДок);	
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
